Revit 2027 API
FabricationConnectorInfo.BodyConnectorId Property
 Fabrication body connector Id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int BodyConnectorId { get; set; }
Public Property BodyConnectorId As Integer
	Get
	Set
public:
property int BodyConnectorId {
	int get ();
	void set (int value);
}
member BodyConnectorId : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentException |  When setting this property: bodyConnectorId is invalid based on the shape and domain.
InvalidOperationException |  When setting this property: the connector cannot be modified on an owned fabrication part. -or- When setting this property: the connector is already connected. -or- When setting this property: the fabrication part is connected to more than one item.
Remarks
 A reference to the fabrication configuration connectors. Setting the connector value will also set the connector lock. A value of 0 indicates the connector is set to none.
See Also
Reference
FabricationConnectorInfo Class
Autodesk.Revit.DB Namespace